app/views/notes/_note.html.erb

<ul>
	<% @track.notes.each do |note| %>
		<li><%= note.note_text %> -
		<%= User.find(note.user_id).email %>
---
SELECT "notes".* FROM "notes"  WHERE "notes"."track_id" = $1  [["track_id", 9]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]