app/views/tracks/_form.html.erb

SELECT "albums".* FROM "albums"
SELECT  "albums".* FROM "albums"  WHERE "albums"."id" = $1 LIMIT 1  [["id", 8]]
---
  <select name="track[album_id]" id="track_album_id">
    <% Album.all.each do |album| %>
      <option value="<%= album.id %>"
      <%= "selected" if album.id == @track.album_id || (!@track.persisted? && !params[:album_id].nil? && Album.find(params[:album_id]).id == album.id) %>>