app/views/tracks/show.html.erb

SELECT  "albums".* FROM "albums"  WHERE "albums"."id" = $1 LIMIT 1  [["id", 7]]
---
<%= button_to "Delete Track!", track_url(@track), method: :delete %>
<%= button_to "Back to Tracks List", album_url(Album.find(@track.album_id)), method: :get %>