app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
SELECT  "bands".* FROM "bands"  WHERE "bands"."id" = $1 LIMIT 1  [["id", 1]]
---
  <select name="album[band_id]" id="album_band_id">
    <% Band.all.each do |band| %>
      <option value="<%= band.id %>"
      <%= "selected" if band.id == @album.band_id || (!@album.persisted? && !params[:band_id].nil? && Band.find(params[:band_id]).id == band.id) %>>