app/views/albums/show.html.erb

<ul>
	<% Track.all.each do |track| %>
---
SELECT "tracks".* FROM "tracks"

<%= button_to "Delete Album!", album_url(@album), method: :delete %>
<%= button_to "Back to Albums List", band_url(Band.find(@album.band_id)), method: :get %>
---
SELECT  "bands".* FROM "bands"  WHERE "bands"."id" = $1 LIMIT 1  [["id", 5]]