app/views/bands/show.html.erb

<ul>
	<% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"