app/controllers/albums_controller.rb

SELECT  "albums".* FROM "albums"  WHERE "albums"."id" = $1 LIMIT 1  [["id", 12]]
---
	def edit
		@album = Album.find(params[:id])

INSERT INTO "albums" ("band_id", "created_at", "edition", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 1], ["created_at", "2014-10-31 03:40:45.172261"], ["edition", "Studio"], ["name", "asdf"], ["updated_at", "2014-10-31 03:40:45.172261"]]
---
	def create
		@album = Album.new(album_params)
		if @album.save

SELECT  "albums".* FROM "albums"  WHERE "albums"."id" = $1 LIMIT 1  [["id", 12]]
UPDATE "albums" SET "name" = $1, "updated_at" = $2 WHERE "albums"."id" = 13  [["name", "Testing2"], ["updated_at", "2014-10-31 07:43:56.151963"]]
---
	def update
		@album = Album.find(params[:id])
		if @album.update(album_params)

SELECT  "albums".* FROM "albums"  WHERE "albums"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]
SELECT  "bands".* FROM "bands"  WHERE "bands"."id" = $1 LIMIT 1  [["id", 1]]
---
	def destroy
		@album = Album.find(params[:id])
		@album.destroy!

		redirect_to band_url(Band.find(@album.band_id))