app/controllers/bands_controller.rb

INSERT INTO "bands" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-10-30 23:37:23.250018"], ["name", "Fall Out Boys"], ["updated_at", "2014-10-30 23:37:23.250018"]]
---
	def create
		@band = Band.new(band_params)
		if @band.save!

SELECT  "bands".* FROM "bands"  WHERE "bands"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = 8  [["name", "Mithra Jin"], ["updated_at", "2014-10-30 23:53:37.382897"]]
---
	def update
		@band = Band.find(params[:id])
		if @band.update!(band_params)

SELECT  "bands".* FROM "bands"  WHERE "bands"."id" = $1 LIMIT 1  [["id", 9]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 9]]
---
	def destroy
		@band = Band.find(params[:id])
		@band.destroy!