app/controllers/notes_controller.rb

INSERT INTO "notes" ("created_at", "note_text", "track_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-10-31 05:47:02.579652"], ["note_text", "asdfasfa"], ["track_id", 9], ["updated_at", "2014-10-31 05:47:02.579652"], ["user_id", 1]]
---
	def create
		@note = Note.new(note_params)
		@note.user_id = current_user.id
		if @note.save

SELECT  "notes".* FROM "notes"  WHERE "notes"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]
---
	def destroy
		@note = Note.find(params[:id])
		if current_user.id == @note.user_id
			@note.destroy!