app/controllers/tracks_controller.rb

	def show
		@track = Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks"  WHERE "tracks"."id" = $1 LIMIT 1  [["id", 1]]

	def edit
		@track = Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks"  WHERE "tracks"."id" = $1 LIMIT 1  [["id", 13]]

	def create
		@track = Track.new(track_params)
		if @track.save
---
INSERT INTO "tracks" ("album_id", "created_at", "edition", "lyrics", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["album_id", 8], ["created_at", "2014-10-31 04:04:05.043922"], ["edition", "Regular"], ["lyrics", "Don't Stop Believing"], ["name", "1825"], ["updated_at", "2014-10-31 04:04:05.043922"]]

	def update
		@track = Track.find(params[:id])
		if @track.update(track_params)
---
SELECT  "tracks".* FROM "tracks"  WHERE "tracks"."id" = $1 LIMIT 1  [["id", 13]]
UPDATE "tracks" SET "edition" = $1, "lyrics" = $2, "name" = $3, "updated_at" = $4 WHERE "tracks"."id" = 13  [["edition", "Bonus"], ["lyrics", "This is testing\r\nNext Line\r\nFormatted text!"], ["name", "sample song"], ["updated_at", "2014-10-31 07:46:38.792519"]]

	def destroy
		@track = Track.find(params[:id])
		@track.destroy!

		redirect_to album_url(Album.find(@track.album_id))
---
SELECT  "tracks".* FROM "tracks"  WHERE "tracks"."id" = $1 LIMIT 1  [["id", 5]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 5]]
SELECT  "albums".* FROM "albums"  WHERE "albums"."id" = $1 LIMIT 1  [["id", 1]]